# ElementId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentId..::..ElementId Property
MEPNetworkSegmentId Class See Also
---
The element id where this analytical segment belongs.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId ElementId { get; set; }
```

Visual Basic
---
```text
Public Property ElementId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ElementId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace